In [6]:
import pandas as pd

apples = pd.Series([3,2,0,1], index = ["Mon","Tue","Wed","Thu"])
oranges = pd.Series([3,2,0,1], index = ["Mon","Tue","Wed","Thu"])

#print(apples,"\n", oranges)
data = {"apples": apples, "oranges": oranges}
fruits_df = pd.DataFrame(data)
print(fruits_df)

     apples  oranges
Mon       3        3
Tue       2        2
Wed       0        0
Thu       1        1

In [18]:
state = ["Ohio","Ohio","Ohio","Nevada","Nevada","Nevada"]
data = {"state": state ,
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6 ,2.4, 2.9, 3.2]}
frame = pd.DataFrame(data, index = ["1st","2nd","3rd","4th","5th","6th"])
print(frame)

      state  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9
6th  Nevada  2003  3.2

In [20]:
frame = pd.DataFrame(data, columns =["year","state", "pop"])
frame.head()

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [23]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop","debt"],
                      index = ["one","two","three","four","five","six"])
frame2.head()

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [26]:
print(frame2.columns)
print(frame2.index)

Index(['year', 'state', 'pop', 'debt'], dtype='object')
Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [32]:
#data["state"] #dict-like notation.
frame2["state"]

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [36]:
frame2.state #attribute-like.

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [38]:
frame2.loc["one"]

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [39]:
print(frame2.loc["two"])

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object